<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2018 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------



return [
         'accessKey'=>'你自己的ak',
         'secretKey'=>'你自己的sk',
         'bucket'=>'你的对象空间',//上传空间名称
         'DOMAIN'=>'你的空间绑定域名.bkt.clouddn.com'//空间绑定的域名
];